# Usage: Mac 移行直後は、ホームディレクトリへこのファイルをコピーして、 `brew bundle` コマンドを実行する。
tap "1password/tap"      # 1Password CLI
tap "homebrew/bundle"    #
tap "yukiarrr/tap"       # ecsk コマンド

brew "biome"             # Biome: Linter & Formatter for JavaScript / TypeScript
brew "circleci"          # CircleCI コマンド
brew "coreutils"         # mise や Ruby の bundle install でも必要とするライブラリを含む。
brew "openssl@3"
brew "curl"              # データ送受信コマンド。
brew "gh"                # GitHub CLI
brew "git"               # Git コマンドは、Mac デフォルトではなく、 Homebrew でインストールする。
brew "git-filter-repo"   # Git からファイル履歴を削除する。
brew "gnupg"             # Terraform で IAM ユーザーを管理するための GPG キー発行に使用する。
brew "grep"              # grep コマンド。当たり前に必要。
brew "imagemagick"       # rmagick gem をインストールするために、ImageMagick@7 が必要。
brew "jq"                # JSON データの加工／整形コマンド。
brew "libyaml"
brew "mise"              # 言語やツールのバージョンを管理する。
brew "mysql@8.0"         # MySQL クライアント。バージョンをアプリケーションで使用中の MySQL 8.0 に合わせる。
brew "pinentry-mac"      # Terraform で IAM ユーザーを管理するための GPG キー発行に使用する。
brew "sheldon"           # シェルのライブラリを管理する。
brew "starship"          # シェル用プロンプト。高速でカスタマイズ性が高い。
brew "telnet"            # RTX ルーターへの接続に使用する。
brew "tree"              # ディレクトリ構造をツリー表示する。
brew "zsh"               # Zsh は Mac デフォルトを使用せず、 Homebrew でインストールする。
brew "yukiarrr/tap/ecsk" # AWS ECS への SSH を簡単にするコマンド。

cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "atok"
cask "brave-browser"
cask "chatgpt"
cask "claude-code"
cask "coteditor"
cask "docker-desktop"
cask "dropbox"
cask "figma"
cask "font-hackgen"      # Starship が必要とするフォント。
cask "font-hackgen-nerd" # Starship が必要とするフォント。
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "obsidian"
cask "postman"
cask "slack"
cask "spotify"
cask "typora" # 有償ソフトウェアであるため、インストール後のライセンス購入が必要。
cask "visual-studio-code"
cask "keepingyouawake"
cask "zoom"
