# Usage: Mac 移行直後は、ホームディレクトリへこのファイルをコピーして、 `brew bundle` コマンドを実行する。
tap "1password/tap"       # 1Password CLI
tap "homebrew/bundle"     #
tap "homebrew/cask"       #
tap "homebrew/cask-fonts" # Font HackGen
tap "homebrew/core"       #
tap "yukiarrr/tap"        # ecsk コマンド
brew "act"                # GitHub Actions をローカル実行する。
brew "asdf"               # 言語やツールのバージョンを管理する。
brew "circleci"           # CircleCI コマンド
brew "coreutils"          # asdf に必要なライブラリ。
brew "curl"               # データ送受信コマンド。 asdf にも必要。
brew "openssl@1.1"        # CSR を作成するなど、 SSL 関連のライブラリ。
brew "git"                # Git コマンドは、Mac デフォルトではなく、 Homebrew でインストールする。
brew "gnupg"              # Terraform で IAM ユーザーを管理するための GPG キー発行に使用する。
brew "pinentry-mac"       # Terraform で IAM ユーザーを管理するための GPG キー発行に使用する。
brew "grep"               # grep コマンド。当たり前に必要。
brew "jq"                 # JSON データの加工／整形コマンド。
brew "sheldon"            # シェルのライブラリを管理する。
brew "starship"           # シェル用プロンプト。高速でカスタマイズ性が高い。
brew "tree"               # ディレクトリ構造をツリー表示する。
brew "zsh"                # Zsh は Mac デフォルトを使用せず、 Homebrew でインストールする。
brew "yukiarrr/tap/ecsk"  # AWS ECS への SSH を簡単にするコマンド。
cask "1password-cli"      # 1Password CLI
cask "font-hackgen"       # iTerm2 や Starship で使用するフォント。
cask "font-hackgen-nerd"  # iTerm2 や Starship で使用するフォント。
