# Usage: Mac 移行直後は、ホームディレクトリへこのファイルをコピーして、 `brew bundle` コマンドを実行する。
tap "1password/tap"       # 1Password CLI
tap "homebrew/bundle"     #
tap "homebrew/cask"       #
tap "homebrew/cask-fonts" # Font HackGen
tap "homebrew/core"       #
tap "yukiarrr/tap"        # ecsk コマンド

brew "asdf"               # 言語やツールのバージョンを管理する。
brew "circleci"           # CircleCI コマンド
brew "coreutils"          # asdf に必要なライブラリ。
brew "curl"               # データ送受信コマンド。 asdf にも必要。
brew "openssl@1.1"        # CSR を作成するなど、 SSL 関連のライブラリ。
brew "openssl@3"
brew "git"                # Git コマンドは、Mac デフォルトではなく、 Homebrew でインストールする。
brew "git-filter-repo"    # Git からファイル履歴を削除する。
brew "gnupg"              # Terraform で IAM ユーザーを管理するための GPG キー発行に使用する。
brew "pinentry-mac"       # Terraform で IAM ユーザーを管理するための GPG キー発行に使用する。
brew "grep"               # grep コマンド。当たり前に必要。
brew "jq"                 # JSON データの加工／整形コマンド。
brew "mysql@8.0"          # MySQL クライアント。バージョンをアプリケーションで使用中の MySQL 8.0 に合わせる。
brew "imagemagick"        # rmagick gem をインストールするために、ImageMagick@7 が必要。
brew "sheldon"            # シェルのライブラリを管理する。
brew "starship"           # シェル用プロンプト。高速でカスタマイズ性が高い。
brew "tree"               # ディレクトリ構造をツリー表示する。
brew "zsh"                # Zsh は Mac デフォルトを使用せず、 Homebrew でインストールする。
brew "yukiarrr/tap/ecsk"  # AWS ECS への SSH を簡単にするコマンド。
# TODO: cd 代替の zoxide も良さそう。下記URLを参考に。
# https://yiskw713.hatenablog.com/entry/2022/01/16/010000

cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "atok"
cask "brave-browser"
cask "coteditor"
cask "docker"
cask "dropbox"
cask "figma"
cask "font-hackgen"      # Starship が必要とするフォント。
cask "font-hackgen-nerd" # Starship が必要とするフォント。
cask "google-chrome"
cask "arc" # 巷で使いやすいと話題のブラウザ
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "messenger"
cask "notion"
cask "postman"
cask "raycast"
cask "sequel-ace"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
