aki77.rails-db-schema
alefragnani.project-manager
aliariff.vscode-erb-beautify
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bung87.rails
bung87.vscode-gemfile
circleci.circleci
craigmaslowski.erb
cssho.vscode-svgviewer
dbaeumer.vscode-eslint
editorconfig.editorconfig
evondev.dracula-high-contrast
file-icons.file-icons
github.vscode-github-actions
grapecity.gc-excelviewer
gruntfuggly.todo-tree
hashicorp.terraform
hediet.vscode-drawio
ionutvmi.path-autocomplete
jgclark.vscode-todo-highlight
kaiwood.endwise
kayteh.plastic-slate
kevinrose.vsc-python-indent
koichisasada.vscode-rdbg
mgmcdermott.vscode-language-babel
mosapride.zenkaku
ms-ceintl.vscode-language-pack-ja
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
naumovs.color-highlight
njpwerner.autodocstring
nmrmsys.vscode-sql-formatter-mod
pkief.material-icon-theme
salesforce.salesforce-vscode-slds
salesforce.salesforcedx-vscode
salesforce.salesforcedx-vscode-apex
salesforce.salesforcedx-vscode-apex-debugger
salesforce.salesforcedx-vscode-apex-replay-debugger
salesforce.salesforcedx-vscode-core
salesforce.salesforcedx-vscode-lightning
salesforce.salesforcedx-vscode-lwc
salesforce.salesforcedx-vscode-soql
salesforce.salesforcedx-vscode-visualforce
shopify.ruby-extensions-pack
shopify.ruby-lsp
sianglim.slim
sorbet.sorbet-vscode-extension
stoplight.spectral
tamasfe.even-better-toml
tfsec.tfsec
usernamehw.errorlens
vignaeshrama.sfdx-package-xml-generator
wayou.vscode-todo-highlight
yzane.markdown-pdf
