aki77.rails-db-schema
alefragnani.project-manager
aliariff.vscode-erb-beautify
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bung87.rails
bung87.vscode-gemfile
CircleCI.circleci
CraigMaslowski.erb
cssho.vscode-svgviewer
dbaeumer.vscode-eslint
EditorConfig.EditorConfig
evondev.dracula-high-contrast
file-icons.file-icons
github.vscode-github-actions
GrapeCity.gc-excelviewer
Gruntfuggly.todo-tree
hashicorp.terraform
hediet.vscode-drawio
ionutvmi.path-autocomplete
jgclark.vscode-todo-highlight
kaiwood.endwise
kayteh.plastic-slate
KevinRose.vsc-python-indent
mgmcdermott.vscode-language-babel
mosapride.zenkaku
MS-CEINTL.vscode-language-pack-ja
ms-python.black-formatter
ms-python.flake8
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
naumovs.color-highlight
njpwerner.autodocstring
nmrmsys.vscode-sql-formatter-mod
PKief.material-icon-theme
rebornix.ruby
salesforce.salesforce-vscode-slds
salesforce.salesforcedx-vscode
salesforce.salesforcedx-vscode-apex
salesforce.salesforcedx-vscode-apex-debugger
salesforce.salesforcedx-vscode-apex-replay-debugger
salesforce.salesforcedx-vscode-core
salesforce.salesforcedx-vscode-lightning
salesforce.salesforcedx-vscode-lwc
salesforce.salesforcedx-vscode-soql
salesforce.salesforcedx-vscode-visualforce
shd101wyy.markdown-preview-enhanced
sianglim.slim
stoplight.spectral
TabNine.tabnine-vscode
tamasfe.even-better-toml
tfsec.tfsec
usernamehw.errorlens
VignaeshRamA.sfdx-package-xml-generator
wayou.vscode-todo-highlight
wingrunr21.vscode-ruby
yzane.markdown-pdf
