aki77.rails-db-schema
alefragnani.project-manager
aliariff.vscode-erb-beautify
anthropic.claude-code
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
biomejs.biome
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bung87.rails
bung87.vscode-gemfile
circleci.circleci
craigmaslowski.erb
dbaeumer.vscode-eslint
editorconfig.editorconfig
edwinhuish.better-comments-next
file-icons.file-icons
github.vscode-github-actions
grapecity.gc-excelviewer
hashicorp.terraform
hediet.vscode-drawio
hverlin.mise-vscode
ionutvmi.path-autocomplete
kaiwood.endwise
kevinrose.vsc-python-indent
koichisasada.vscode-rdbg
mgmcdermott.vscode-language-babel
mosapride.zenkaku
ms-ceintl.vscode-language-pack-ja
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
naumovs.color-highlight
njpwerner.autodocstring
nmrmsys.vscode-sql-formatter-mod
pkief.material-icon-theme
shopify.ruby-extensions-pack
shopify.ruby-lsp
sianglim.slim
stoplight.spectral
tamasfe.even-better-toml
tfsec.tfsec
usernamehw.errorlens
yzane.markdown-pdf
zhuangtongfa.material-theme
